In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([1, 3, 5, np.nan, 6, 0])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    0.0
dtype: float64

In [3]:
dates = pd.date_range('20170807', periods=6)

In [4]:
dates

DatetimeIndex(['2017-08-07', '2017-08-08', '2017-08-09', '2017-08-10',
               '2017-08-11', '2017-08-12'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2017-08-07 -0.843034  0.784976 -0.002883  0.696391
2017-08-08 -0.028503  2.383054  0.620129 -0.199903
2017-08-09  0.315276 -0.221442 -0.278760  0.196454
2017-08-10 -0.585423  0.622514  1.662672 -0.465867
2017-08-11  0.289006  0.136312 -0.057792 -1.124852
2017-08-12 -1.130548 -1.104467 -0.185260 -0.234038

In [40]:
df.head(2)  # 默认5条

                   A         B         C         D
2017-08-07 -0.843034  0.784976 -0.002883  0.696391
2017-08-08 -0.028503  2.383054  0.620129 -0.199903

In [41]:
df.tail(2)

                   A         B         C         D
2017-08-11  0.289006  0.136312 -0.057792 -1.124852
2017-08-12 -1.130548 -1.104467 -0.185260 -0.234038

In [50]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2017-08-07 -0.843034  0.784976 -0.002883  0.696391
2017-08-08 -0.028503  2.383054  0.620129 -0.199903
2017-08-09  0.315276 -0.221442 -0.278760  0.196454
2017-08-10 -0.585423  0.622514  1.662672 -0.465867
2017-08-11  0.289006  0.136312 -0.057792 -1.124852
2017-08-12 -1.130548 -1.104467 -0.185260 -0.234038

In [52]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2017-08-09  0.315276 -0.221442 -0.278760  0.196454
2017-08-11  0.289006  0.136312 -0.057792 -1.124852
2017-08-08 -0.028503  2.383054  0.620129 -0.199903
2017-08-10 -0.585423  0.622514  1.662672 -0.465867
2017-08-07 -0.843034  0.784976 -0.002883  0.696391
2017-08-12 -1.130548 -1.104467 -0.185260 -0.234038

In [60]:
# 作为 production code 请用优化过的 .at, .iat, .loc, .iloc 和 .ix
df['A'], df[0: 3], df['20170809': '20170811']

(2017-08-07   -0.843034
 2017-08-08   -0.028503
 2017-08-09    0.315276
 2017-08-10   -0.585423
 2017-08-11    0.289006
 2017-08-12   -1.130548
 Freq: D, Name: A, dtype: float64,
                    A         B         C         D
 2017-08-07 -0.843034  0.784976 -0.002883  0.696391
 2017-08-08 -0.028503  2.383054  0.620129 -0.199903
 2017-08-09  0.315276 -0.221442 -0.278760  0.196454,
                    A         B         C         D
 2017-08-09  0.315276 -0.221442 -0.278760  0.196454
 2017-08-10 -0.585423  0.622514  1.662672 -0.465867
 2017-08-11  0.289006  0.136312 -0.057792 -1.124852)

In [65]:
df.loc[dates[0]]

A   -0.843034
B    0.784976
C   -0.002883
D    0.696391
Name: 2017-08-07 00:00:00, dtype: float64

In [66]:
df.loc[:, ['B', 'C']]

                   B         C
2017-08-07  0.784976 -0.002883
2017-08-08  2.383054  0.620129
2017-08-09 -0.221442 -0.278760
2017-08-10  0.622514  1.662672
2017-08-11  0.136312 -0.057792
2017-08-12 -1.104467 -0.185260

In [70]:
df.iloc[3:6, 0:3]

                   A         B         C
2017-08-10 -0.585423  0.622514  1.662672
2017-08-11  0.289006  0.136312 -0.057792
2017-08-12 -1.130548 -1.104467 -0.185260

In [71]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2017-08-08 -0.028503  0.620129
2017-08-09  0.315276 -0.278760
2017-08-11  0.289006 -0.057792

In [76]:
df[df.A > 0] + 1

                   A         B         C         D
2017-08-09  1.315276  0.778558  0.721240  1.196454
2017-08-11  1.289006  1.136312  0.942208 -0.124852

In [77]:
df[df > 0]

                   A         B         C         D
2017-08-07       NaN  0.784976       NaN  0.696391
2017-08-08       NaN  2.383054  0.620129       NaN
2017-08-09  0.315276       NaN       NaN  0.196454
2017-08-10       NaN  0.622514  1.662672       NaN
2017-08-11  0.289006  0.136312       NaN       NaN
2017-08-12       NaN       NaN       NaN       NaN

In [78]:
df2 = df.copy()

In [80]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2017-08-07 -0.843034  0.784976 -0.002883  0.696391    one
2017-08-08 -0.028503  2.383054  0.620129 -0.199903    one
2017-08-09  0.315276 -0.221442 -0.278760  0.196454    two
2017-08-10 -0.585423  0.622514  1.662672 -0.465867  three
2017-08-11  0.289006  0.136312 -0.057792 -1.124852   four
2017-08-12 -1.130548 -1.104467 -0.185260 -0.234038  three

In [84]:
df2[df2['E'].isin(['two', 'one'])]

                   A         B         C         D    E
2017-08-07 -0.843034  0.784976 -0.002883  0.696391  one
2017-08-08 -0.028503  2.383054  0.620129 -0.199903  one
2017-08-09  0.315276 -0.221442 -0.278760  0.196454  two

In [81]:
dic = {
    'A': 1.,
    'B': pd.date_range('20170807', periods=4),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test","train","test","train"]),
    'F': ['日也', '弄干', '罚科', 'shit']
}
df1 = pd.DataFrame(dic, index=np.arange(1, 5))
df1

     A          B    C  D      E     F
1  1.0 2017-08-07  1.0  3   test    日也
2  1.0 2017-08-08  1.0  3  train    弄干
3  1.0 2017-08-09  1.0  3   test    罚科
4  1.0 2017-08-10  NaN  3  train  shit

In [38]:
df1.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [ ]:
df1.B

1   2017-08-07
2   2017-08-08
3   2017-08-09
4   2017-08-10
Name: B, dtype: datetime64[ns]

In [43]:
df1.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [46]:
df1.describe()  # 显示数据的概要

         A    C    D
count  4.0  3.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0